Table of Contents
 Class ConcreteULSCheckResultInteraction
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
ULS Check Interaction base
public abstract class ConcreteULSCheckResultInteraction : ConcreteCheckResultBase
Inheritance
object
ConcreteCheckResultBase
ConcreteULSCheckResultInteraction
Derived
ConcreteULSCheckResultInteractionEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
 Edit this page